// Синтетические события - 

/************************************************************************/

// useRef
// В Реакте для ссылки используется useRef7


/************************************************************************/
// Преимущества React
// 1. Увеличить производительность с Virtual Dom
// 2. JSX облегчает написание и чтение кода
// 3. Компонентный подход...

/************************************************************************/

// Условное рендеринг 
// 1. Двойной амперсант
// 2. Тернайрный оператор

/************************************************************************/

// Компонент переключатель (Switching Component) 

/************************************************************************/

// React - Children, Component, useState, useEffect... 
// ReactDOM - render, findDOMNode

/************************************************************************/

// HOC - Это обычная функция которая принимает компонент как аргумент и 
// возврашает новую компоненту.

/************************************************************************/



