// HTML валидация - Проверка html документ сспециальном валидатором W3C. Проверяет написан ли html документ
// со стандартными правилами или нет.

/******************************************************************************/

// Инлайновый стиль - Это написать стиль прямо в элемент. ЕГоможноизменить с important

/******************************************************************************/

// undefined vs null
// Оба обозначают отсутствие значение. Undefined будет в таких случаях когда создаем
//переменную но еще не присвоивали. Второй случай, когджа функция нечего не вернет.

// function foo(){
//   let name = 'Bahram';

// }
// console.log(foo());

// const obj = {}
// console.log(obj.a)

//--------------------------------------

//Что качается null, это явная задание отсутствуещего значение. Когда разработчик разработчик самостоятельно определяет 
//отсутствие каких либо данных.

/******************************************************************************/

// console.log(a); //undefined
// var a=1
// console.log(a); //1

/******************************************************************************/

//В javascript 3логических операторов. && || !

// && ноходить первое ложное значение и возврашает
// || ноходить первое истинное значение и возврашает

/******************************************************************************/

// function findShort(str){
//   return str.split(' ').sort((a,b)=> a.length-b.length)[0]
// }

// // console.log(findShort('The smallest word in the sentence'));
// console.log(findShort('My name is Bahram'));

