//Прогрессивный рендеринг

/****************************************************************************/

// //Создать объект без прототипа

// const a = Object.create(null);
// a.name = "Bahram";
// console.log(a);
// //Создать объект с прототипа
// const b = { job: "Programmer" };
// console.log(b);

/****************************************************************************/

// Temporal dead zone - Временная мертвая зона
//Если вызываем переменные которые объявлены с let, const до объявления

/*************************************************************/

// AJAX - Термин которое описывает подход использование несколько существующего технологии вместе.
// С помощю него мы отправляем или получам данные с сервера без перезагрузки страниц.

/****************************************************************************/

//HTMLCollection - Динамическая структура данных
//NodeList - Статическая структура данных

/****************************************************************************/

// const capitals = (str) =>
//   str.split("").reduce((res, cur, i) => {
//     if (cur === cur.toUpperCase()) {
//       res.push(i);
//     }
//     return res;
//   }, []);

//---------------------------------------------

// const capitals = (str) =>
//   str
//     .split("")
//     .reduce(
//       (res, cur, i) => (cur === cur.toUpperCase() ? [...res, i] : res),
//       []
//     );

// console.log(capitals("CodEWaRs"));
