//Websocket
/***************************************************/

//Атрибут key в React
//Он нужен для того чтобы знать какие элементы были изменены,добалены или удалены.

/***************************************************/

//Pure Component
// Если компонент не принимает пропсы и всегда возврашает одно и тоже результат.

/***************************************************/

const toCapitalCase = (str) => {
  // return str
  //   .split(" ")
  //   .reduce(
  //     (res, cur) => (res += cur[0].toUpperCase() + cur.substr(1) + " "),
  //     ""
  //   );
  //-----------------------------------------------------------------------
  // return str
  //   .split(" ")
  //   .reduce(
  //     (res, cur) => [...res, cur[0].toUpperCase() + cur.substr(1) + " "],
  //     []
  //   );
  //-----------------------------------------------------------------------
  return str
    .split(" ")
    .map((word) => word[0].toUpperCase() + word.slice(1))
    .join(" ");
};
console.log(toCapitalCase("Lorem ipsum is simply, dummy"));
