// React reconciliation - 
// Сверка виртуального дома с реальной дом

/*****************************************************************/

// Context - 
// Способ передача данных через дерево компонентов. 
// С помощю него мы избавимся от передача своиств вручную на каждую уровню  

/*****************************************************************/

// Hooks - 
// Эта встроенные функции которые позволяет работать полностю без 
// классов. Они не работаеют в внутри классов.

/*****************************************************************/

// Props && State
// Оба обычный js объекты. Пропсы это как параметры в функции, приходят с наружии
// State это как переменное, бъявится внутри компонета.

/*****************************************************************/
// Fragment
// Когда возврашаем несколько html элементы, их надо обернуть с еше один блок.
// 