
// Сетантичние теги - эта теги которые носят смыслового объяснения. Эти теги - Header, Footer, Main, Aside...

/******************************************************************************/

// В css 5 основных типов позиционирования
// Static - дефолтный тип позиционирования
// Relative - Элемент позиционируется относительно своего текущего положения.
// Absolute - Позиционируется относительно другого элемента у которого позиционирование не static.
//Если такого нет, то относительно окна браузера.
// Fixed - позиционирование только относительно окна браузера.
// Sticky - он тоже как фиксед, но когда скроллиться вместе с родителем.

/******************************************************************************/

// В javascript существует 8 основных типов.
// Number
// String
// Boolean
// Object
// Undefined
// Null
// Symbol
// Bigint

/******************************************************************************/

 // const isPolindrome = (str) => {
//   return str.toLowerCase() === str.toLowerCase().split("").reverse().join("")
//     ? "Polindrome"
//     : "Not Polindrome";
// };
// console.log(isPolindrome("Anna"));

