// Правильно сверстать с картинкой
{/* <figure>
  <img/>
  <figcaption>
    text
  </figcaption>
</figure> */}

/******************************************************************************/

// HOF - Функция высшего порядка
// Эти те функции которые возврашаеют другие функции или принимает фукции в качестве аргумента.
// В JS есть встройные функции MAP, FILTER, REDUCE, FOREACH. Они все HOF  


/******************************************************************************/

//DOM - Это объектная модель документа полученного от сервера в виде html кода.
// HTML код - это текст в странице. A DOM - это набор связанных объектов созданных браузерам при парсинге этого текста.

/******************************************************************************/

// const toInitials = (str) => {
//   // return str.split(" ").map((item, i) => item[0].toUpperCase() + ".").join('');
//   return str.split(" ").map((item) => `${item.slice(0,1).toUpperCase()}.`).join('');
// };

// console.log(toInitials("bahram Atahanov"));

