//HTML - Язык гипертекстого разметка, а не язык программировании.  Его основная задача 
//помочь браузеру как нужно отобразить информации.

/******************************************************************************/

// CCS правила формируется из двух основных состовляющих.

/******************************************************************************/

// Превратить любой тип джанных в булевый. 
//Boolean('str')
//!!'str'

// console.log(!'str');

/******************************************************************************/

//stopPropogation() - остоновить всплытие. То есть, не рендериться все родительские элементы до html


/******************************************************************************/

